---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.SpaceSet.ForwardIterator
source: html/2dbd2aae-3da6-8f11-cfa8-32d919e3f2e2.htm
---
# Autodesk.Revit.DB.Mechanical.SpaceSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual SpaceSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.